# Ultralytics YOLO11-P2-Green (P5 Removed)
# Optimized for INT8 Quantization & Edge Deployment
# Removed P5 (Layers 10-13) to save FLOPs/Params

# Parameters
nc: 1 # number of classes
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]

# Backbone (Stops at P4)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]   # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, CoordAtt, [256]]    # 3 <--- P2 Attention

  - [-1, 1, Conv, [256, 3, 2]]  # 4-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 5
  - [-1, 1, CoordAtt, [512]]    # 6 <--- P3 Attention

  - [-1, 1, Conv, [512, 3, 2]]  # 7-P4/16
  - [-1, 2, C3k2, [512, True]]  # 8
  - [-1, 1, CoordAtt, [512]]    # 9 <--- P4 Attention (STOP HERE, NO P5)

# Head
head:
  # --- Top-Down Path (Starts from P4 now) ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10 (Upsample P4)
  - [[-1, 6], 1, Concat, [1]] # 11 cat backbone P3 (Layer 6)
  - [-1, 2, C3k2, [256, False]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13 (Upsample P3)
  - [[-1, 3], 1, Concat, [1]] # 14 cat backbone P2 (Layer 3)
  - [-1, 2, C3k2, [128, False]] # 15 (P2 Output - High Res)

  # --- Bottom-Up Path ---
  - [-1, 1, Conv, [128, 3, 2]] # 16 (Downsample P2)
  - [[-1, 12], 1, Concat, [1]] # 17 cat head P3 (Layer 12)
  - [-1, 2, C3k2, [256, False]] # 18 (P3 Output)

  - [-1, 1, Conv, [256, 3, 2]] # 19 (Downsample P3)
  - [[-1, 9], 1, Concat, [1]] # 20 cat backbone P4 (Layer 9)
  - [-1, 2, C3k2, [512, True]] # 21 (P4 Output)

  # --- Detection Head ---
  # Detects on P2 (15), P3 (18), P4 (21)
  - [[15, 18, 21], 1, Detect, [nc]] # 22