# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# Custom YOLO11-seg with Coordinate Attention & Native Prototype Mask Assembly (YOLACT-based)

# Parameters
nc: 36
scales:
  s: [0.50, 0.50, 1024]

# YOLO11n backbone (TIDAK ADA PERUBAHAN DI SINI)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 2, C3k2, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]]  # 9
  - [-1, 2, C2PSA, [1024]]  # 10

# YOLO11n head (MODIFIKASI PADA BAGIAN INI)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, Concat, [1]]  # 12 cat backbone P4
  - [-1, 2, C3k2, [512, False]]  # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 4], 1, Concat, [1]]  # 15 cat backbone P3
  - [-1, 2, C3k2, [256, False]]  # 16 (Fitur P3/8-small matang)
  
  # === MODIFIKASI 1: Injeksi CoordAtt di Skala Kecil (P3) ===
  - [-1, 1, CoordAtt, [256]]     # 17 <--- Fokus atensi pada fitur kecil

  - [-1, 1, Conv, [256, 3, 2]]   # 18
  - [[-1, 13], 1, Concat, [1]]   # 19 cat head P4
  - [-1, 2, C3k2, [512, False]]  # 20 (Fitur P4/16-medium matang)
  
  # === MODIFIKASI 2: Injeksi CoordAtt di Skala Menengah (P4) ===
  - [-1, 1, CoordAtt, [512]]     # 21 <--- Fokus atensi pada fitur medium

  - [-1, 1, Conv, [512, 3, 2]]   # 22
  - [[-1, 10], 1, Concat, [1]]   # 23 cat head P5
  - [-1, 2, C3k2, [1024, True]]  # 24 (Fitur P5/32-large matang)
  
  # === MODIFIKASI 3: Injeksi CoordAtt di Skala Besar (P5) ===
  - [-1, 1, CoordAtt, [1024]]    # 25 <--- Fokus atensi pada fitur besar

  # === PROTOTYPE MASK ASSEMBLY ===
  # Native dari Ultralytics (terinspirasi YOLACT). 
  # Input diubah dari [16, 20, 24] menjadi [17, 21, 25] (Mengambil dari CoordAtt)
  - [[17, 21, 25], 1, Segment, [nc, 32, 256]]  # 26 Detect(P3, P4, P5)