# Ultralytics YOLO11-P2-CoordAtt Custom Architecture
# Modified for License Plate Detection (Small Objects)
# Changes:
# 1. Added Coordinate Attention (CoordAtt) to Backbone P2, P3, P4
# 2. Shifted Detection Head from P3-P5 to P2-P4

# Parameters
nc: 1 # number of classes (Set to 1 for License Plate)
scales: 
  s: [0.50, 0.50, 1024]

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, CoordAtt, [256]]          # 3 <--- ADDED ATTENTION (P2 Feature Map)

  - [-1, 1, Conv, [256, 3, 2]] # 4-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 5
  - [-1, 1, CoordAtt, [512]]          # 6 <--- ADDED ATTENTION (P3 Feature Map)

  - [-1, 1, Conv, [512, 3, 2]] # 7-P4/16
  - [-1, 2, C3k2, [512, True]] # 8
  - [-1, 1, CoordAtt, [512]]   # 9 <--- ADDED ATTENTION (P4 Feature Map)

  - [-1, 1, Conv, [1024, 3, 2]] # 10-P5/32
  - [-1, 2, C3k2, [1024, True]] # 11
  - [-1, 1, SPPF, [1024, 5]]    # 12
  - [-1, 2, C2PSA, [1024]]      # 13 (End of Backbone)

# Head
head:
  # --- Upsampling Path (Top-Down) ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 9], 1, Concat, [1]] # 15 cat backbone P4 (Layer 9)
  - [-1, 2, C3k2, [512, False]] # 16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 17
  - [[-1, 6], 1, Concat, [1]] # 18 cat backbone P3 (Layer 6)
  - [-1, 2, C3k2, [256, False]] # 19

  # New P2 Extension
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 20 (Upsample to P2 size)
  - [[-1, 3], 1, Concat, [1]] # 21 cat backbone P2 (Layer 3)
  - [-1, 2, C3k2, [128, False]] # 22 (This is P2 Output - High Res)

  # --- Downsampling Path (Bottom-Up) ---
  - [-1, 1, Conv, [128, 3, 2]] # 23
  - [[-1, 19], 1, Concat, [1]] # 24 cat head P3 (Layer 19)
  - [-1, 2, C3k2, [256, False]] # 25 (This is P3 Output - Medium Res)

  - [-1, 1, Conv, [256, 3, 2]] # 26
  - [[-1, 16], 1, Concat, [1]] # 27 cat head P4 (Layer 16)
  - [-1, 2, C3k2, [512, True]] # 28 (This is P4 Output - Low Res)

  # --- Detection Head ---
  # Detects on Layers 22 (P2), 25 (P3), 28 (P4)
  # Replaces the standard [P3, P4, P5]
  - [[22, 25, 28], 1, Detect, [nc]] # 29